feat: add test case
